app/Models/UserPsychologicalModel.php

INSERT INTO `user_psychological` (`uid`, `email`, `is_register`, `created_at`) VALUES (87, 'ken760717@gmail.com', 1, '2025-07-31 03:59:27')
---
    public function add(int $uid,string $email,int $is_register)
    {
        $data = [
            'uid'  => $uid,
            'email' => $email,
            'is_register' => $is_register,
            'created_at'  => Time::now('UTC')->toDateTimeString(),
        ];

        $this->insert($data);

SELECT *
FROM `user_psychological`
WHERE `email` = 'ken760717@gmail.com'
---
    public function checkEmailExist(string $email)
    {
        $data = $this->select('*')
                    ->where('email', $email)
                    ->find();