app/Models/UserNotificationsModel.php

    public function add(array $data)
    {
        $data = [
            'user_id'  => $data['user_id'],
            'title' => $data['title'],
            'content'  => $data['content'],
            'is_read' => 0,
            'is_delete'  => 0,
            'notification_type' => 'General',
            'is_show' => 1,
            'created_at'  => Time::now('UTC')->toDateTimeString(),
            'updated_at'  => Time::now('UTC')->toDateTimeString(),
        ];

        $this->insert($data);
---
INSERT INTO `user_notifications` (`user_id`, `title`, `content`, `is_read`, `is_delete`, `notification_type`, `is_show`, `created_at`, `updated_at`) VALUES ('87', '心理測驗活動獎勵', '親愛的同學 ，您好：\r\n\r\n                    感謝您參加本次 LTrust 所推出的「你是哪種學習型人格」心理測驗活動！\r\n\r\n                    您已完成 email 登記，我們已為您發送 3000 點紅利至帳戶中。\r\n\r\n                    紅利可用於兌換 LTrust 上的各項學習服務，目前 S.E.N.S.E.I 解題教練問到飽 正在進行中，同學不要害羞，免費期間盡量用起來！\r\n\r\n                    此外，平台也同步舉辦「紅利提款機挑戰賽」，可以再LTrust首頁BANNER上找到「Lucky7 紅利提款機大賽」的活動喔！天天完成任務還能額外賺紅利，快來看看吧💰\r\n\r\n                    ', 0, 0, 'General', 1, '2025-07-31 03:59:27', '2025-07-31 03:59:27')