app/Models/UserModel.php

UPDATE `user_users` SET `bonus_points` = 31000, `updated_at` = '2025-07-31 03:59:27'
WHERE `user_users`.`id` IN (87)
---
    public function updateBonus(int $uid,int $bonus,int $before)
    {
        $db = Database::connect();

        // 啟動
        $db->transBegin();
        try {

            $utcNow = Time::now('UTC')->toDateTimeString();

            $data = [
            'bonus_points' => $bonus + $before,
            'updated_at' => $utcNow,
        ];
            $this->update($uid,$data);

SELECT *
FROM `user_users`
WHERE `email` = 'ken760717@gmail.com'
---
    public function getUserInfoByEmail(string $email)
    {
        $data = $this->select('*')
                    ->where('email', $email)
                    ->find();